In [27]:
import numpy as np
import pandas as pd
import datetime



data=pd.read_csv("Q1_data.csv")
data.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

Consider only the rows with country_id = "BDV" (there are 844 such rows). For each site_id, we can compute the number of unique user_id's found in these 844 rows. Which site_id has the largest number of unique users? And what's the number?

In [10]:
data1=data[data["country_id"]=="BDV"] #subsetting by BDV

data1.groupby('site_id')['user_id'].nunique().sort_values(ascending=False) #grouping and sorting by site id and userid

site_id
5NPAU    544
N0OTG     90
3POLC      2
Name: user_id, dtype: int64

Between 2019-02-03 00:00:00 and 2019-02-04 23:59:59, there are four users who visited a certain site more than 10 times. Find these four users & which sites they (each) visited more than 10 times. (Simply provides four triples in the form (user_id, site_id, number of visits) in the box below.)

In [28]:
import datetime
#changing it to time
timeDF=(pd.to_datetime(data['ts'].str.strip()))
data['ts']=timeDF

In [39]:
time1=datetime.datetime(2019, 2, 3, 0, 0, 0)
time2=datetime.datetime(2019, 2, 4, 23, 59, 59)

#subsetting by the designated times
data2=data[(data['ts']>time1) & (data['ts']<time2)]
data2.head()

                      ts user_id country_id site_id
1049 2019-02-03 00:02:31  LC3C7E        TL6   3POLC
1050 2019-02-03 00:03:09  LC3C7E        TL6   3POLC
1051 2019-02-03 00:03:46  LC3C7E        TL6   3POLC
1052 2019-02-03 00:04:12  LC3C7E        TL6   3POLC
1053 2019-02-03 00:04:25  LC3C7E        TL6   3POLC

In [62]:
#group by site and user id and count where country code is greater than 10
g1 = data2['country_id'].groupby([data2['site_id'],data2['user_id']])
g1.count()[g1.count()>10]

site_id  user_id
3POLC    LC3C7E     15
N0OTG    LC06C3     25
         LC3A59     26
         LC3C9D     17
Name: country_id, dtype: int64

For each site, compute the unique number of users whose last visit (found in the original data set) was to that site. For instance, user "LC3561"'s last visit is to "N0OTG" based on timestamp data. Based on this measure, what are top three sites? (hint: site "3POLC" is ranked at 5th with 28 users whose last visit in the data set was to 3POLC; simply provide three pairs in the form (site_id, number of users).)

In [124]:
#finiding the last visits
last_visits=data.groupby([data['user_id']], as_index=False).agg({'ts' : 'max', 'site_id': 'last'})

In [125]:
#Creating count table for each site
ast_visits['site_id'].value_counts()

5NPAU    992
N0OTG    561
QGO3G    289
GVOFK     42
3POLC     28
RT9Z6      2
EUZ/Q      1
JSUUP      1
Name: site_id, dtype: int64

For each user, determine the first site he/she visited and the last site he/she visited based on the timestamp data. Compute the number of users whose first/last visits are to the same website. What is the number?

In [111]:
#first visit
first=data.groupby([data['user_id']], as_index=False).agg({'ts' : 'min', 'site_id': 'first'})

In [119]:
#last visit
last=data.groupby([data['user_id']], as_index=False).agg({'ts' : 'max', 'site_id': 'last'})

In [113]:
first

     user_id                  ts site_id
0     LC00C3 2019-02-03 18:52:50   5NPAU
1     LC01C3 2019-02-04 11:35:10   5NPAU
2     LC05C3 2019-02-02 14:14:44   5NPAU
3     LC06C3 2019-02-01 22:49:39   N0OTG
4     LC07C3 2019-02-05 19:06:42   5NPAU
...      ...                 ...     ...
1911  LCFC3B 2019-02-05 04:53:03   N0OTG
1912  LCFC3D 2019-02-01 18:59:50   N0OTG
1913  LCFC3E 2019-02-01 20:49:08   5NPAU
1914  LCFEC3 2019-02-02 01:19:49   N0OTG
1915  LCFFC3 2019-02-02 22:36:23   N0OTG

[1916 rows x 3 columns]

In [121]:
last

     user_id                  ts site_id
0     LC00C3 2019-02-03 18:52:50   5NPAU
1     LC01C3 2019-02-04 11:35:10   5NPAU
2     LC05C3 2019-02-02 14:14:44   5NPAU
3     LC06C3 2019-02-07 01:16:12   N0OTG
4     LC07C3 2019-02-05 19:06:42   5NPAU
...      ...                 ...     ...
1911  LCFC3B 2019-02-05 04:53:03   N0OTG
1912  LCFC3D 2019-02-01 18:59:50   N0OTG
1913  LCFC3E 2019-02-01 20:49:13   5NPAU
1914  LCFEC3 2019-02-07 06:23:59   3POLC
1915  LCFFC3 2019-02-05 03:31:17   N0OTG

[1916 rows x 3 columns]

In [127]:
#getting the number of matches
len(first[first['site_id']==last['site_id']])

1670